app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `otp`, `otp_expires_at`) VALUES ('smijith', 'sdasda@gmail.com', '$2y$10$kn741nYHQ2TLyxK/wmbBieEifJczRobMZmKUMBptpzuFH4QMHmsjG', 712339, '2023-08-12 14:48:40')
---
            ];

            $usersModel = new \App\Models\UsersModel();
        $query = $usersModel->insert($values);

SELECT *
FROM `users`
WHERE `email` = 'ssadasd@gmail.com'
AND `otp` = '280981'
 LIMIT 1
UPDATE `users` SET `is_verified` = 1, `otp` = NULL, `otp_expires_at` = NULL
WHERE `users`.`id` IN ('77')
---
public function verifyOTP()
{
    $sessionEmail = session()->get('verify_email');

    if ($sessionEmail) {
        $validation = $this->validate([
            'otp' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'OTP is required'
                ]
            ]
        ]);

        if ($validation) {
            $otp = $this->request->getPost('otp');

            $usersModel = new \App\Models\UsersModel();
            $user = $usersModel->where(['email' => $sessionEmail, 'otp' => $otp])->first();

            if ($user && strtotime($user['otp_expires_at']) >= time() && $otp === $user['otp']) {

                try {
                    $updateData = [
                        'is_verified' => 1,
                        'otp' => null,
                        'otp_expires_at' => null
                    ];
                    $affectedRows = $usersModel->update($user['id'], $updateData);

SELECT *
FROM `users`
WHERE `email` = 'ssadasd@gmail.com'
 LIMIT 1
---
function check() {
    $validation = $this->validate([
        'email'=>[
            'rules'=>'required|valid_email|is_not_unique[users.email]',
            'errors'=>[
                'required'=>'email is required',
                'valid_email'=>'you must enter a valid mail',
                'is_not_unique'=>'This mail is not registered'
            ]
        ],
        'password'=>[
            'rules'=>'required|min_length[5]|max_length[12]',
            'errors'=>[
                'required'=>'password is required',
                'min_length'=>'min 5 characters required',
                'max_length'=>'max 5 characters required'
            ]
        ]
    ]);

    if (!$validation) {
        return view('auth/login',['validation'=>$this->validator]);
    } else {
        $email=$this->request->getPost('email');
        $password=$this->request->getPost('password');
        $usersModel = new \App\Models\UsersModel();
        $user_info = $usersModel->where('email', $email)->first();