app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '77'
---
    function profile(){
        $usersModel =new \App\Models\UsersModel();
        $loggedUserID= session()->get('loggedUser');
        $userInfo =$usersModel->find($loggedUserID);